.lisp/my-org-configuration.org
* Emacs Configure File
  group emacs init file in a org file.

** config single file sign_id                                       :sign_id:
    #+BEGIN_SRC emacs-lisp
      (defconst revolt-init-version "$Id: revolt-rebuild-init.el,v 1.0 2019/09/06 20:30:18 Anti-RoteLearning$")
    #+END_SRC
** Package Settings
*** config emacs install packages sources
    #+BEGIN_SRC emacs-lisp
   (require 'package)
   ;; unactive auto install package when emacs startup
   (setq package-enable-at-startup nil)
   ;; Enable Melpa
   (setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                            ("melpa" . "http://melpa.org/packages/")))
                           ;; ("melpa-stable" . "https://melpa-stable.milkbox.net/packages/")
   (package-initialize)
  #+END_SRC
*** fix emacs install package error
 #+BEGIN_SRC emacs-lisp
   ;; Fix Emacs's unknown and untrusted anthirity TLS error
   ;; link: https://blog.vifortech.com/posts/emacs-tls-fix/
   ;; libressl link: http://ftp.openbsd.org/pub/OpenBSD/LibreSSL/

   (require 'gnutls)
   (add-to-list 'gnutls-trustfiles "/usr/loca/etc/ssl/cert.pem")
 #+END_SRC
*** DONE manage your installed packages
    CLOSED: [2019-09-19 四 13:18]
#+BEGIN_SRC emacs-lisp
;; need common lisp replay
(require 'cl)
;; manage all installed packages
(defvar revolt/packages '(
                          ;; --- python support ---
                          elpy
                          ;; --- org mode support ---
                          org-bullets
                          ;; --- inhence your ability
                          yasnippet
                          undo-tree
                          ;; --- fast select text ---
                          expand-region
                          ;; --- better replace text ---
                          anzu
                          ;; --- clean all white space line ---
                          whitespace-cleanup-mode
                          ;; --- remove current cursor white space
                          shrink-whitespace
                          ;; --- Themes ---
                          doom-modeline
                          doom-themes
                          ;; --- manage package methods ---
                          use-package
                          ;; --- auto-completion ---
                          company
                          auto-complete
                          ;; --- better editor ---
                          swiper
                          multiple-cursors
                          smartparens
                          easy-kill
                          ;; --- helm-mode ---
                          helm
                          helm-descbinds
                          ;; --- youdao-dictionary ---
                          youdao-dictionary
                          ;; --- aggressive-indent ---
                          aggressive-indent
                          ;; --- use package ---
                          use-package
                          ;; --- literary programming ---
                          adaptive-wrap
                          ;; --- emacs emojj ---
                          emojify
                          ;; --- plantuml---
                          plantuml-mode
                          )"Default Packages")

(setq package-selected-packages revolt/packages)

;; datemine the packages state
(defun revolt/packages-installed-p ()
  (loop for pkg in revolt/packages
        when (not (package-installed-p pkg)) do (return nil)
        finally (return t)))

;; install package by package installed state
(unless (revolt/packages-installed-p)
     (message "%s" "Refreshing package melpa database...")
     (package-refresh-contents)
     (dolist (pkg revolt/packages)
       (when (not (package-installed-p pkg))
         (package-install pkg))))
#+END_SRC
*** use **use-package** manage emacs startup package status
 #+BEGIN_SRC emacs-lisp
   ;; use-package
   ;; manually.It will do automagic installation.delayed loading and things.
   (unless (package-installed-p 'use-package)
     (package-refresh-contents)
     (package-install 'use-package))

   (require 'use-package)
   (setq use-package-always-ensure t)
 #+END_SRC
** open init file                                                :initialize:
#+BEGIN_SRC emacs-lisp
  ;; open init file
  (defun revolt/open-my-init-file()
    "Open the user's init.el file"
    (interactive)
    (find-file (expand-file-name "~/.emacs.d/init.el")))
#+END_SRC
** auto save,backup,session                         :backup:session:autosave:
*** auto save
  #+BEGIN_SRC emacs-lisp
    ;; auto save often
    ;; save evary 20 characters typed(minium char numbers)
    (setq auto-save-interval 16)
  #+END_SRC
*** backup settings
**** Emacs's built-in backup settings

     see here: [[https://www.emacswiki.org/emacs/BackupDirectory][BackupDirectory]]

        1. we use Emacs's built in backup settings
        2. Use `ForceBackups`
        3. emacs never backs up versioned files,we want to backup
           versioned file. so we use `vc-make-backup-files` backup
           versioned file.
        4. next, **we configure emacs to handle multiple backups**:

     #+BEGIN_SRC emacs-lisp
       (setq
        backup-by-copying t     ; copy all files,don't rename them.
        kept-new-versions 10    ; keep 10 latest versions
        kept-old-versions 0     ; don't bother with old versions
        delete-old-versions t   ; don't ask to delete excess backup versions.
        version-control t       ; number backups
        vc-make-backup-files t) ; backup version controlled files
     #+END_SRC

     1. if you want to avoid `backup-by-copying`,you can instead use
        =(setq backup-by-copying-when-linked t)=
        1) but that makes the second,"per save”backup below not
           run,since buffers with no backing file on disk are not backed
           up,and renaming removes the backing file.
        2) The "per session" backup will happen in any case,you'll just
           have less consistent numbering of per-save backups.
        3) only the second and subsquent save will result in per-save
           backups.
     2. if you want to avoid backing up some files,e.g. large files
        1) try setting =backup-enable-predicate=
        2) you'll want to extends =normal-backup-enable-predicate=,which
           already avoids things like backing up file in ~/tmp~.
*****    **backup file size limit**
          #+BEGIN_SRC emacs-lisp
            (defvar revolt/backup-file-size-limit (* 5 1024 1024)
              "Maximum size of a file (in bytes) that should be copied at each savepoint.")
          #+END_SRC
