.lisp/my-org-configuration.el
(defconst revolt-init-version "$Id: revolt-rebuild-init.el,v 1.0 2019/09/06 20:30:18 Anti-RoteLearning$")

(require 'package)
;; unactive auto install package when emacs startup
(setq package-enable-at-startup nil)
;; Enable Melpa
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/")))
                        ;; ("melpa-stable" . "https://melpa-stable.milkbox.net/packages/")
(package-initialize)

;; Fix Emacs's unknown and untrusted anthirity TLS error
;; link: https://blog.vifortech.com/posts/emacs-tls-fix/
;; libressl link: http://ftp.openbsd.org/pub/OpenBSD/LibreSSL/

(require 'gnutls)
(add-to-list 'gnutls-trustfiles "/usr/loca/etc/ssl/cert.pem")

;; need common lisp replay
(require 'cl)
;; manage all installed packages
(defvar revolt/packages '(
                          ;; --- python support ---
                          elpy
                          ;; --- org mode support ---
                          org-bullets
                          ;; --- inhence your ability
                          yasnippet
                          undo-tree
                          ;; --- fast select text ---
                          expand-region
                          ;; --- better replace text ---
                          anzu
                          ;; --- clean all white space line ---
                          whitespace-cleanup-mode
                          ;; --- remove current cursor white space
                          shrink-whitespace
                          ;; --- Themes ---
                          doom-modeline
                          doom-themes
                          ;; --- manage package methods ---
                          use-package
                          ;; --- auto-completion ---
                          company
                          auto-complete
                          ;; --- better editor ---
                          swiper
                          multiple-cursors
                          smartparens
                          easy-kill
                          ;; --- helm-mode ---
                          helm
                          helm-descbinds
                          ;; --- youdao-dictionary ---
                          youdao-dictionary
                          ;; --- aggressive-indent ---
                          aggressive-indent
                          ;; --- use package ---
                          use-package
                          ;; --- literary programming ---
                          adaptive-wrap
                          ;; --- emacs emojj ---
                          emojify
                          ;; --- plantuml ---
                          plantuml-mode
                          ;; --- org mode ---
                          gnuplot
                          )"Default Packages")

(setq package-selected-packages revolt/packages)

;; datemine the packages state
(defun revolt/packages-installed-p ()
  (loop for pkg in revolt/packages
        when (not (package-installed-p pkg)) do (return nil)
        finally (return t)))

;; install package by package installed state
(unless (revolt/packages-installed-p)
     (message "%s" "Refreshing package melpa database...")
     (package-refresh-contents)
     (dolist (pkg revolt/packages)
       (when (not (package-installed-p pkg))
         (package-install pkg))))

;; use-package
;; manually.It will do automagic installation.delayed loading and things.
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; open init file
(defun revolt/open-my-init-file()
  "Open the user's init.el file"
  (interactive)
  (find-file (expand-file-name "~/.emacs.d/init.el")))

;; auto save often
;; save evary 20 characters typed(minium char numbers)
(setq auto-save-interval 16)

(setq
 backup-by-copying t     ; copy all files,don't rename them.
 kept-new-versions 10    ; keep 10 latest versions
 kept-old-versions 0     ; don't bother with old versions
 delete-old-versions t   ; don't ask to delete excess backup versions.
 version-control t       ; number backups
 vc-make-backup-files t) ; backup version controlled files

(defvar revolt/backup-file-size-limit (* 5 1024 1024)
  "Maximum size of a file (in bytes) that should be copied at each savepoint.")
