.lisp/my-org-configuration.org
**** Emacs backup on each save
     1. we make two kinds of backups
        - per-session backups,once on the first save of each emacs
          session.
        - per-save backups,once on every save.
     2. emacs creates the backup dirs automatically if they don't exit
     3. **my own backups directory**
        #+BEGIN_SRC emacs-lisp
          ;; base directory for backup files.
          (defvar revolt/backup-location (expand-file-name "~/emacs-backups"))
          ;; unwanted backups directory
          (defvar revolt/backup-trash-dir (expand-file-name "~/.Trash"))
          ;; don't backup when matching this regexp
          ;; files whose full name matches this regexp backup to `revolt/backup-trash-dir`
          ;; set to nil to disable this.
          (defvar revolt/backup-exclude-regexp nil)
        #+end_SRC
     4. **Default Per-save backups**
        - eg：`(("" . ,(expand-file-name "per-save" "~/.emacs.d")))
          ;; the results is `(("" . "/home/revolt/.emacs.d/per-save"))`
           #+BEGIN_SRC emacs-lisp
             ;; default per save backups directory
             (setq backup-directory-alist
                   `(("" . ,(expand-file-name "per-save" revolt/backup-location))))
             ;; trash dir
             (if revolt/backup-exclude-regexp
                 (add-to-list 'back-directory-alist `(,revolt/backup-exclude-regexp . ,revolt/backup-trash-dir)))
           #+END_SRC
     5. **backup every save**
        backup files every time when they are saved.
        - files are backup to `revolt/backup-location` in
          subdirectories once per emacs session. "per save" every time
          when a file is saved.
        - files whose name match the REGEXP in
          `revolt/backup-exclude-regexp` are copied to
          `revolt/backup-trash-dir` instead of the normal backup
          directory.
        - files larger than `revolt/backup-file-size-limit` are not
          backed.

         #+BEGIN_SRC emacs-lisp
           (defun revolt/backup-every-save()
             ;; make a special "per session" backup at the first save of each
             ;; emacs session
             (when (not buffer-backed-up)
               ;; overrid the default parameters for per-session backups.
               (let ((backup-directory-alist
                      `(("." . ,(expand-file-name "per-session" revolt/backup-location))))
                     (kept-new-versions 3))
                 ;; add trash dir if needed
                 (if revolt/backup-exclude-regexp
                     (add-to-list
                      'backup-directory-alist
                      `(,revolt/backup-exclude-regexp . ,revolt/backup-trash-dir)))
                 ;; the file too large
                 (if (<= (buffer-size) revolt/backup-file-size-limit)
                     (progn
                       (message "Made per session backup of %s" (buffer-name))
                       (backup-buffer))
                   (message "WARING: File %s too large to backup -increase value of revolt/backup-file-size-limit" (buffer-name))))))
         #+END_SRC
     6. add to save hook
        #+BEGIN_SRC emacs-lisp
          (add-hook 'before-save-hook 'revolt/backup-every-save)
        #+END_SRC
     7. save various mode - revert buffer if file changes on disk
        #+BEGIN_SRC emacs-lisp
          (global-auto-revert-mode 1)
        #+END_SRC
**** config session
     1. save various settings between session,and lighter version of desktop
        #+BEGIN_SRC emacs-lisp
          (use-package session
            :init
            (add-hook 'after-init-hook 'session-initialize))
        #+END_SRC
**** config recent files list
     1. save recent files list
        #+BEGIN_SRC emacs-lisp
          (use-package recentf
            :config
            (progn
              ;; save every 10 minutes
              (run-at-time nil (* 10 60) 'recentf-save-list)
              ;; recentf file maxnumber set 1000
              (setq recentf-max-saved-items 1000
                    recentf-auto-cleanup 'never
                    recentf-exclude '("/ssh:"))
              (recentf-mode t)))
        #+END_SRC
** customize face                                                      :face:
   config emacs themes,font,startup,etc..
*** use doom themes
 #+BEGIN_SRC emacs-lisp
   ;; (use-package doom-themes
   ;;   :ensure t
   ;;   :config
   ;;   (load-theme 'doom-dracula t))
   (setq doom-themes-enable-bold t
         doom-themes-enable-italic t) ; if nil, italics is universally disabled

   ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
   ;; may have their own settings.
   (load-theme 'doom-moonlight t)

   ;; Enable flashing mode-line on errors
   (doom-themes-visual-bell-config)

   ;; Enable custom neotree theme (all-the-icons must be installed!)
   (doom-themes-neotree-config)
   ;; or for treemacs users
   (doom-themes-treemacs-config)

   ;; Corrects (and improves) org-mode's native fontification.
   (doom-themes-org-config)
 #+END_SRC
*** use doom mode-line
#+BEGIN_SRC emacs-lisp
  ;; use doom-modeline
  (require 'doom-modeline)
  (doom-modeline-mode 1)

  (global-hl-line-mode 1)

  ;;show line numbers
  (global-linum-mode t)

  ;; Close Tool Bar
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  ;;Close startup help screen
  (setq inhibit-splash-screen 1)

  ;; Set Cursor Style
  (setq-default cursor-type 'bar)
#+END_SRC
*** no start message
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
#+END_SRC

*** echo command keys more quickly
#+BEGIN_SRC emacs-lisp
  (setq echo-keystrokes 0.5)
#+END_SRC

*** diminish minor modes from mode lines to save space
    you could find =use-package= paramter in here: [[https://jwiegley.github.io/use-package/keywords/][use-package-parameter-link]]
#+BEGIN_SRC emacs-lisp
  (use-package diminish
    ;; use-package make diminish mode load package from elpa
    ;; `ensure keywords` causes the packages to be installed automatically
    ;; if you wish this behavior to be glbal for all packages.you should set
    ;; (setq use-package-always-ensure t)

    ;; diminish keys,it's purpose is to remove minior mode string in your mode line.
    ;; demand keys,prevent defered loading in all cases.
    :ensure t
    :demand t
    :diminish abbrev-mode
    :diminish auto-fill-funcition)
#+END_SRC

*** highlight current line
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode +1)
#+END_SRC
*** visualise whitespace
#+BEGIN_SRC emacs-lisp
  (use-package whitespace
    :diminish whitespace-mode)
#+END_SRC
**** turn off highlight long lines
 #+BEGIN_SRC emacs-lisp
   (setq whitespace-line-column 10000)
 #+END_SRC
*** volatile highlights - highlight changes from pasting etc.
#+BEGIN_SRC emacs-lisp
  (use-package volatile-highlights
    :diminish volatile-highlights-mode
    :config
    (volatile-highlights-mode t))
#+END_SRC
*** youdao dictionary
#+BEGIN_SRC emacs-lisp
  (require 'youdao-dictionary)
  (global-set-key (kbd "C-c y") 'youdao-dictionary-search-at-point)
  (global-set-key (kbd "C-c v") 'youdao-dictionary-play-voice-at-point)
  (global-set-key (kbd "C-c s") 'youdao-dictionary-search)
#+END_SRC
*** meaningful names for buffers with the same name
    you could see here: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Uniquify.html][uniquify refer link]]

    when several buffers visit identically-named files,emacs must give the
    buffers distinct names.

    the default methods add a suffix based on the names of the directories
    that contain the file.

    you could open =init.el= files in =~/.emacs.d= and =.emacs.bak= see different.

    You can choose from several different styles for constructing unique
    buffer names, by customizing the option =uniquify-buffer-name-style=.

#+BEGIN_SRC emacs-lisp
  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)
  (setq uniquify-separator "/")
  (setq uniquify-after-kill-buffer-p t)         ;rename after kill uniquify buffer
  (setq uniquify-ignore-buffers-re "^\\*")	;don't muck with special buffers
#+END_SRC
*** more useful frame title,that show either a file or a buffer
refer link: [[https://www.emacswiki.org/emacs/FrameTitle][Frame title]]

- frame title is changed by changing the value of the variable
  =frame-title-format=.
- the ~icon~ title can be changed with =icon-title-format=.
#+BEGIN_SRC emacs-lisp
  ;; invocation name: program name,is `emacs`
    ;; (setq frame-title-format
    ;;  '("" invocation-name " - "
    ;;    (:eval (if (buffer-file-name)
    ;;               (abbreviate-file-name (buffer-file-name))
    ;;             "%b"))))
  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))
          (:eval (if (buffer-modified-p)
                     " •"))
          " - Emacs")
        )
#+END_SRC
*** rainbow-mode
#+BEGIN_SRC emacs-lisp
;;  (use-package rainbow-mode)
#+END_SRC
*** rainbow delimiters - show matching brackets etc
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters)
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+END_SRC
*** show page breaks
#+BEGIN_SRC emacs-lisp
  (use-package page-break-lines
  :diminish page-break-lines-mode
  :config
    (global-page-break-lines-mode 1)
    (setq page-break-lines-modes '(emacs-lisp-mode lisp-mode scheme-mode compilation-mode outline-mode help-mode org-mode ess-mode latex-mode)))
#+END_SRC
*** scroll buffer of cursor is this many lines from the top or bottom
#+BEGIN_SRC emacs-lisp
(setq scroll-mavrgin 3)
#+END_SRC
*** restore window configurations
#+BEGIN_SRC emacs-lisp
(winner-mode t)
#+END_SRC
*** emacs-emojj
   #+BEGIN_SRC emacs-lisp
   (add-hook 'after-init-hook #'global-emojify-mode)
   #+END_SRC

** auto completion
#+BEGIN_SRC emacs-lisp
  ;; active company mode
  (add-hook 'after-init-hook 'global-company-mode)

  ;; immediately display advice
  (setq company-idle-delay 0)
  ;; Show suggestions after entering one character.
  (setq company-minimum-prefix-length 1)
  (setq company-selection-wrap-around t)

  ;; Use tab key to cycle through suggestions.
  ;; ('tng' means 'tab and go')
  (company-tng-configure-default)
#+END_SRC
** better default
