.lisp/my-org-configuration.el

;; base directory for backup files.
(defvar revolt/backup-location (expand-file-name "~/emacs-backups"))
;; unwanted backups directory
(defvar revolt/backup-trash-dir (expand-file-name "~/.Trash"))
;; don't backup when matching this regexp
;; files whose full name matches this regexp backup to `revolt/backup-trash-dir`
;; set to nil to disable this.
(defvar revolt/backup-exclude-regexp nil)

;; default per save backups directory
(setq backup-directory-alist
      `(("" . ,(expand-file-name "per-save" revolt/backup-location))))
;; trash dir
(if revolt/backup-exclude-regexp
    (add-to-list 'back-directory-alist `(,revolt/backup-exclude-regexp . ,revolt/backup-trash-dir)))

(defun revolt/backup-every-save()
  ;; make a special "per session" backup at the first save of each
  ;; emacs session
  (when (not buffer-backed-up)
    ;; overrid the default parameters for per-session backups.
    (let ((backup-directory-alist
           `(("." . ,(expand-file-name "per-session" revolt/backup-location))))
          (kept-new-versions 3))
      ;; add trash dir if needed
      (if revolt/backup-exclude-regexp
          (add-to-list
           'backup-directory-alist
           `(,revolt/backup-exclude-regexp . ,revolt/backup-trash-dir)))
      ;; the file too large
      (if (<= (buffer-size) revolt/backup-file-size-limit)
          (progn
            (message "Made per session backup of %s" (buffer-name))
            (backup-buffer))
        (message "WARING: File %s too large to backup -increase value of revolt/backup-file-size-limit" (buffer-name))))))

(add-hook 'before-save-hook 'revolt/backup-every-save)

(global-auto-revert-mode 1)

(use-package session
  :init
  (add-hook 'after-init-hook 'session-initialize))

(use-package recentf
  :config
  (progn
    ;; save every 10 minutes
    (run-at-time nil (* 10 60) 'recentf-save-list)
    ;; recentf file maxnumber set 1000
    (setq recentf-max-saved-items 1000
          recentf-auto-cleanup 'never
          recentf-exclude '("/ssh:"))
    (recentf-mode t)))

;; (use-package doom-themes
;;   :ensure t
;;   :config
;;   (load-theme 'doom-dracula t))
(setq doom-themes-enable-bold t
      doom-themes-enable-italic t) ; if nil, italics is universally disabled

;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
;; may have their own settings.
(load-theme 'doom-moonlight t)

;; Enable flashing mode-line on errors
(doom-themes-visual-bell-config)

;; Enable custom neotree theme (all-the-icons must be installed!)
(doom-themes-neotree-config)
;; or for treemacs users
(doom-themes-treemacs-config)

;; Corrects (and improves) org-mode's native fontification.
(doom-themes-org-config)

;; use doom-modeline
(require 'doom-modeline)
(doom-modeline-mode 1)

(global-hl-line-mode 1)

;;show line numbers
(global-linum-mode t)

;; Close Tool Bar
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
;;Close startup help screen
(setq inhibit-splash-screen 1)

;; Set Cursor Style
(setq-default cursor-type 'bar)

(setq inhibit-startup-message t)

(setq echo-keystrokes 0.5)

(use-package diminish
  ;; use-package make diminish mode load package from elpa
  ;; `ensure keywords` causes the packages to be installed automatically
  ;; if you wish this behavior to be glbal for all packages.you should set
  ;; (setq use-package-always-ensure t)

  ;; diminish keys,it's purpose is to remove minior mode string in your mode line.
  ;; demand keys,prevent defered loading in all cases.
  :ensure t
  :demand t
  :diminish abbrev-mode
  :diminish auto-fill-funcition)

(global-hl-line-mode +1)

(use-package whitespace
  :diminish whitespace-mode)

(setq whitespace-line-column 10000)

(use-package volatile-highlights
  :diminish volatile-highlights-mode
  :config
  (volatile-highlights-mode t))

(require 'youdao-dictionary)
(global-set-key (kbd "C-c y") 'youdao-dictionary-search-at-point)
(global-set-key (kbd "C-c v") 'youdao-dictionary-play-voice-at-point)
(global-set-key (kbd "C-c s") 'youdao-dictionary-search)

(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)
(setq uniquify-separator "/")
(setq uniquify-after-kill-buffer-p t)         ;rename after kill uniquify buffer
(setq uniquify-ignore-buffers-re "^\\*")	;don't muck with special buffers

;; invocation name: program name,is `emacs`
  ;; (setq frame-title-format
  ;;  '("" invocation-name " - "
  ;;    (:eval (if (buffer-file-name)
  ;;               (abbreviate-file-name (buffer-file-name))
  ;;             "%b"))))
(setq frame-title-format
      '((:eval (if (buffer-file-name)
                   (abbreviate-file-name (buffer-file-name))
                 "%b"))
        (:eval (if (buffer-modified-p)
                   " •"))
        " - Emacs")
      )

;;  (use-package rainbow-mode)

(use-package rainbow-delimiters)
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

(use-package page-break-lines
:diminish page-break-lines-mode
:config
  (global-page-break-lines-mode 1)
  (setq page-break-lines-modes '(emacs-lisp-mode lisp-mode scheme-mode compilation-mode outline-mode help-mode org-mode ess-mode latex-mode)))

(setq scroll-mavrgin 3)

(winner-mode t)

(add-hook 'after-init-hook #'global-emojify-mode)

;; active company mode
(add-hook 'after-init-hook 'global-company-mode)

;; immediately display advice
(setq company-idle-delay 0)
;; Show suggestions after entering one character.
(setq company-minimum-prefix-length 1)
(setq company-selection-wrap-around t)

;; Use tab key to cycle through suggestions.
;; ('tng' means 'tab and go')
(company-tng-configure-default)
