.lisp/my-org-configuration.org
*** auto-fill mode
    #+BEGIN_SRC emacs-lisp
    (add-hook 'text-mode-hook 'turn-on-auto-fill)
    (add-hook 'org-mode-hook 'turn-on-auto-fill)
    (add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
#+END_SRC
*** fill or unfill paragraph from endless parentheses
    #+BEGIN_SRC emacs-lisp
      (defun endless/fill-or-unfill ()
        "Like `fill-paragraph', but unfill if used twice."
        (interactive)
        (let ((fill-column
               (if (eq last-command 'endless/fill-or-unfill)
                   (progn (setq this-command nil)
                          (point-max))
                 fill-column)))
          (call-interactively #'fill-paragraph)))

      (global-set-key [remap fill-paragraph]
                      #'endless/fill-or-unfill)
     #+END_SRC
**** releated to unfill - join following lines                   :keybinding:
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-j")
                  (lambda ()
                    (interactive)
                    (join-line -1)))
#+END_SRC
*** smart mode
    #+BEGIN_SRC emacs-lisp
      (require 'smartparens-config)
      (add-hook 'js-mode-hook #'smartparens-mode)
      (add-hook 'python-mode-hook #'smartparens-mode)
      (add-hook 'emacs-lisp-mode-hook #'smartparens-mode)
      ;; by M-x sp-cheat-sheet
    #+END_SRC
*** neotree mode
    #+BEGIN_SRC emacs-lisp
      (use-package neotree
        :bind (("<f8>" . neotree-toggle)))
    #+END_SRC
*** aggressive-indent
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
(add-hook 'css-mode-hook #'aggressive-indent-mode)
(add-hook 'plantuml-mode-hook #'aggressive-indent-mode)
(add-hook 'python-mode-hook #'aggressive-indent-mode)



;; global active aggressive indent
(global-aggressive-indent-mode 1)

#+END_SRC
*** TODO set timestamps
#+BEGIN_SRC emacs-lisp

#+END_SRC
*** highlight matching parentheses
    #+BEGIN_SRC emacs-lisp
      (add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
    #+END_SRC
*** comment tools
    comment lines easily
 #+BEGIN_SRC emacs-lisp
   (global-set-key (kbd "M-;") 'comment-dwim-2)
 #+END_SRC
*** spelling
#+BEGIN_SRC emacs-lisp
  (use-package flyspell
    :diminish (flyspell-mode . "spell")
    :config
    (set-face-attribute 'flyspell-incorrect nil
                        :background "selectedKnobColor"
                        :underline '(:color "red")
                        :weight 'bold))
#+END_SRC
**** turn on flyspell in desired modes
1. install human dictionary =en_US= ,you could find in here [[https://github.com/hunspell/hunspell][hunspell#Usage]]
   =en_GB= correspond is ~british=, maybe you should install =aspell-en=.
2. see this blog,see hunspell usage [[http://gromnitsky.blogspot.com/2016/09/emacs-251-hunspell.html][hunspell]]

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)
  (setq ispell-dictionary "american")
  (setq ispell-check-comments t)
  (setq ispell-really-hunspell t)
  (setq ispell-program-name "hunspell")
  (setq ispell-local-dictionary-alist
        `(("american" "[[:alpha:]]" "[^[:alpha:]]" "[']" t ("-d" "en_US") nil
           utf-8)))
#+END_SRC
**** flyspell in windows settings
#+BEGIN_EXAMPLE
;; CUSTOMISE - hunspell
;;
;; comment the two lines above and uncomment the lines below to set up
;; hunspell on windows. You'll need to edit the path to the hunspell
;; directory in both of the following lines - i.e. replace "Users/ben"
;; and "Users\\ben" with the path to your hunspell directory
;;
;; (setq ispell-program-name "C:/Users/ben/hunspell/bin/hunspell.exe")
;; (setq ispell-local-dictionary-alist
;;       `(("british" "[[:alpha:]]" "[^[:alpha:]]" "[']" t ("-d" "en_GB"
;; "-p" "C:\\Users\\ben\\hunspell\\share\\hunspell\\en_GB") nil
;; utf-8)))
#+END_EXAMPLE
*** change case of letters
#+BEGIN_SRC emacs-lisp
  (defun toggle-letter-case ()
    "Toggle the letter case of current word or text selection.
  Toggles between: “all lower”, “Init Caps”, “ALL CAPS”."
    (interactive)
    (let (p1 p2 (deactivate-mark nil) (case-fold-search nil))
      (if (region-active-p)
          (setq p1 (region-beginning) p2 (region-end))
        (let ((bds (bounds-of-thing-at-point 'word) ) )
          (setq p1 (car bds) p2 (cdr bds)) ) )

      (when (not (eq last-command this-command))
        (save-excursion
          (goto-char p1)
          (cond
           ((looking-at "[[:lower:]][[:lower:]]") (put this-command 'state "all lower"))
           ((looking-at "[[:upper:]][[:upper:]]") (put this-command 'state "all caps") )
           ((looking-at "[[:upper:]][[:lower:]]") (put this-command 'state "init caps") )
           ((looking-at "[[:lower:]]") (put this-command 'state "all lower"))
           ((looking-at "[[:upper:]]") (put this-command 'state "all caps") )
           (t (put this-command 'state "all lower") ) ) )
        )

      (cond
       ((string= "all lower" (get this-command 'state))
        (upcase-initials-region p1 p2) (put this-command 'state "init caps"))
       ((string= "init caps" (get this-command 'state))
        (upcase-region p1 p2) (put this-command 'state "all caps"))
       ((string= "all caps" (get this-command 'state))
        (downcase-region p1 p2) (put this-command 'state "all lower")) )
      )
    )
  ;;set this to M-c
  (global-set-key "\M-c" 'toggle-letter-case)
#+END_SRC
** search and move                                              :search:move:
*** mark ring navigation
#+BEGIN_SRC emacs-lisp
(setq set-mark-command-repeat-pop t)
#+END_SRC
** editing                                                             :edit:
*** improved text expansion with M-/
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-/") 'hippie-expand)
  (setq hippie-expand-try-functions-list
        '(try-expand-dabbrev
          try-expand-dabbrev-all-buffers
          try-expand-dabbrev-from-kill
          try-complete-file-name-partially
          try-complete-file-name
          try-expand-all-abbrevs
          try-expand-list
          try-expand-line
          try-complete-lisp-symbol-partially
          try-complete-lisp-symbol))
#+END_SRC

*** abbreviations
#+BEGIN_SRC emacs-lisp
  (setq-default abbrev-mode t)
  (setq save-abbrrevs 'silently)                ;; save abbreviations upon exiting emacs
  (if (file-exists-p abbrev-file-name)
    (quitely-read-abbrev-file))                 ;; read the abbreviations file on startup
#+END_SRC

*** use space instead of tabs
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

*** delete the selectiosn with a keypress
#+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
#+END_SRC

*** cpoy with eamcs
#+BEGIN_SRC emacs-lisp
(setq mouse-drag-copy-region t)
#+END_SRC

*** save wahtever's in the current system clipboard before replacing it with then emacs's text
#+BEGIN_SRC emacs-lisp
  (setq save-interprogram-paste-before-kill t)
#+END_SRC

*** cua-mode for rectangle
    cua mode info link: [[https://www.emacswiki.org/emacs/CuaMode][cua mode]] , just imitate win =C-x= , =C-v= control text.so we don't use it.
    #+BEGIN_SRC emacs-lisp
      (use-package cua-base
        :init
        (progn
          (cua-mode 1)
          (cua-selection-mode t))
        :config
        (progn
          (setq cua-enable-cua-keys nil)		;;only for rectangles
          (setq cua-auto-tabify-rectangles nil)))     ;; don't tabify after rectangles commands
    #+END_SRC

*** anzu for nicer query replace
#+BEGIN_SRC emacs-lisp
  (use-package anzu
    :diminish anzu-mode
    :bind (("M-%" . anzu-query-replace)
           ("C-M-%" . anzu-query-replace-regexp))
    :config
    (global-anzu-mode))
#+END_SRC
*** multiple cursors
#+BEGIN_SRC emacs-lisp
;; multiple cursors
(use-package multiple-cursors
  :ensure t
  :bind (("C-c m c" . mc/edit-lines)
         ("C-S-c C-S-c" . mc/edit-lines)
         ("M-." . mc/mark-next-like-this)
         ("M-," . mc/unmark-next-like-this)
         ("C-S-<mouse-1>" . mc/add-cursor-on-click)
         ("C-'" . mc-hide-unmatched-lines)))

#+END_SRC

*** expand region with a key
#+BEGIN_SRC emacs-lisp
;; expand region with a key
(use-package expand-region
  :bind ("C-=" . er/expand-region))
#+END_SRC

*** use undo tree mode - powerful undo /redo visualization
    #+BEGIN_SRC emacs-lisp
      (setq undo-tree-mode t)
    #+END_SRC
*** yasnippet to insert text template
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode
    :config
    (yas-global-mode 1)
    (setq yas-indent-line nil))
#+END_SRC
*** shrink whitespace,cycling through amount
#+BEGIN_SRC emacs-lisp
  (use-package shrink-whitespace
    :ensure t
    :bind (("M-s SPC" . shrink-whitespace)))
#+END_SRC
**** clean whitespace upon saving
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'whitespace-cleanup)
#+END_SRC
*** copy line if no region selected
#+BEGIN_SRC emacs-lisp
    (use-package easy-kill
      :ensure t
      :bind (([remap kill-ring-save] . easy-kill)))
#+END_SRC
*** add the ability yo cut the current line,without marking it   :wonderful:

    from prelude,this should be after volatile-highlights is required.

#+BEGIN_SRC emacs-lisp
  (require 'rect)
  (defadvice kill-region (before smart-cut activate compile)
    "when called interactively with no active region,kill a single line instead."
  (interactive
  (if mark-active (list (region-beginning) (region-end) rectangle-mark-mode)
    (list (line-beginning-position)
          (line-beginning-position 2)))))
#+END_SRC
** TODO file management
   see this  link: [[https://oremacs.com/2015/01/13/dired-options/][emacs-dired-refer]]

