.lisp/my-org-configuration.el

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
(add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)

(defun endless/fill-or-unfill ()
  "Like `fill-paragraph', but unfill if used twice."
  (interactive)
  (let ((fill-column
         (if (eq last-command 'endless/fill-or-unfill)
             (progn (setq this-command nil)
                    (point-max))
           fill-column)))
    (call-interactively #'fill-paragraph)))

(global-set-key [remap fill-paragraph]
                #'endless/fill-or-unfill)

(global-set-key (kbd "M-j")
                (lambda ()
                  (interactive)
                  (join-line -1)))

(require 'smartparens-config)
(add-hook 'js-mode-hook #'smartparens-mode)
(add-hook 'python-mode-hook #'smartparens-mode)
(add-hook 'emacs-lisp-mode-hook #'smartparens-mode)
;; by M-x sp-cheat-sheet

(use-package neotree
  :bind (("<f8>" . neotree-toggle)))

(add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
(add-hook 'css-mode-hook #'aggressive-indent-mode)
(add-hook 'plantuml-mode-hook #'aggressive-indent-mode)
(add-hook 'python-mode-hook #'aggressive-indent-mode)



;; global active aggressive indent
(global-aggressive-indent-mode 1)



(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)

(global-set-key (kbd "M-;") 'comment-dwim-2)

(use-package flyspell
  :diminish (flyspell-mode . "spell")
  :config
  (set-face-attribute 'flyspell-incorrect nil
                      :background "selectedKnobColor"
                      :underline '(:color "red")
                      :weight 'bold))

(add-hook 'text-mode-hook 'flyspell-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)
(setq ispell-dictionary "american")
(setq ispell-check-comments t)
(setq ispell-really-hunspell t)
(setq ispell-program-name "hunspell")
(setq ispell-local-dictionary-alist
      `(("american" "[[:alpha:]]" "[^[:alpha:]]" "[']" t ("-d" "en_US") nil
         utf-8)))

(defun toggle-letter-case ()
  "Toggle the letter case of current word or text selection.
Toggles between: “all lower”, “Init Caps”, “ALL CAPS”."
  (interactive)
  (let (p1 p2 (deactivate-mark nil) (case-fold-search nil))
    (if (region-active-p)
        (setq p1 (region-beginning) p2 (region-end))
      (let ((bds (bounds-of-thing-at-point 'word) ) )
        (setq p1 (car bds) p2 (cdr bds)) ) )

    (when (not (eq last-command this-command))
      (save-excursion
        (goto-char p1)
        (cond
         ((looking-at "[[:lower:]][[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]][[:upper:]]") (put this-command 'state "all caps") )
         ((looking-at "[[:upper:]][[:lower:]]") (put this-command 'state "init caps") )
         ((looking-at "[[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]]") (put this-command 'state "all caps") )
         (t (put this-command 'state "all lower") ) ) )
      )

    (cond
     ((string= "all lower" (get this-command 'state))
      (upcase-initials-region p1 p2) (put this-command 'state "init caps"))
     ((string= "init caps" (get this-command 'state))
      (upcase-region p1 p2) (put this-command 'state "all caps"))
     ((string= "all caps" (get this-command 'state))
      (downcase-region p1 p2) (put this-command 'state "all lower")) )
    )
  )
;;set this to M-c
(global-set-key "\M-c" 'toggle-letter-case)

(setq set-mark-command-repeat-pop t)

(global-set-key (kbd "M-/") 'hippie-expand)
(setq hippie-expand-try-functions-list
      '(try-expand-dabbrev
        try-expand-dabbrev-all-buffers
        try-expand-dabbrev-from-kill
        try-complete-file-name-partially
        try-complete-file-name
        try-expand-all-abbrevs
        try-expand-list
        try-expand-line
        try-complete-lisp-symbol-partially
        try-complete-lisp-symbol))

(setq-default abbrev-mode t)
(setq save-abbrrevs 'silently)                ;; save abbreviations upon exiting emacs
(if (file-exists-p abbrev-file-name)
  (quitely-read-abbrev-file))                 ;; read the abbreviations file on startup

(setq-default indent-tabs-mode nil)

(delete-selection-mode t)

(setq mouse-drag-copy-region t)

(setq save-interprogram-paste-before-kill t)

(use-package cua-base
  :init
  (progn
    (cua-mode 1)
    (cua-selection-mode t))
  :config
  (progn
    (setq cua-enable-cua-keys nil)		;;only for rectangles
    (setq cua-auto-tabify-rectangles nil)))     ;; don't tabify after rectangles commands

(use-package anzu
  :diminish anzu-mode
  :bind (("M-%" . anzu-query-replace)
         ("C-M-%" . anzu-query-replace-regexp))
  :config
  (global-anzu-mode))

;; multiple cursors
(use-package multiple-cursors
  :ensure t
  :bind (("C-c m c" . mc/edit-lines)
         ("C-S-c C-S-c" . mc/edit-lines)
         ("M-." . mc/mark-next-like-this)
         ("M-," . mc/unmark-next-like-this)
         ("C-S-<mouse-1>" . mc/add-cursor-on-click)
         ("C-'" . mc-hide-unmatched-lines)))

;; expand region with a key
(use-package expand-region
  :bind ("C-=" . er/expand-region))

(setq undo-tree-mode t)

(use-package yasnippet
  :ensure t
  :diminish yas-minor-mode
  :bind(("C-c ( C-n" . yas-new-snippet)
        ("C-c ( C-s " . yas-insert-snippet)
        ("C-c ( C-v" . yas-visit-snippet-file))
  :config
  (yas-global-mode 1)
  (setq yas-indent-line nil))

(use-package shrink-whitespace
  :ensure t
  :bind (("M-s SPC" . shrink-whitespace)))

(add-hook 'before-save-hook 'whitespace-cleanup)

(use-package easy-kill
  :ensure t
  :bind (([remap kill-ring-save] . easy-kill)))

(require 'rect)
(defadvice kill-region (before smart-cut activate compile)
  "when called interactively with no active region,kill a single line instead."
(interactive
(if mark-active (list (region-beginning) (region-end) rectangle-mark-mode)
  (list (line-beginning-position)
        (line-beginning-position 2)))))
