.lisp/my-org-configuration.el

(setq dired-listing-switches "-alh --group-directories-first")
;; l: Is the only mandatory one.
;; a: Means to list invisible files.
;; G: Don't show group information. These days, when there are more laptops than people, the group info is rarely useful.
;; h: Human readable sizes, such as M for mebibytes.
;; 1v: Affects the sorting of digits, hopefully in a positive way.
;; --group-directories-first: self-explanatory, I like to have the directories on the top, separate from the files.

(recentf-mode 1)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)

;; helm setting
(helm-mode 1)
(require 'helm)
(require 'helm-config)

(when (executable-find "curl")
  (setq helm-google-suggest-use-curl-p t))

(setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
      helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
      helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
      helm-ff-file-name-history-use-recentf t
      helm-echo-input-in-header-line t)

(defun spacemacs//helm-hide-minibuffer-maybe ()
  "Hide minibuffer in Helm session if we use the header line as input field."
  (when (with-helm-buffer helm-echo-input-in-header-line)
    (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
      (overlay-put ov 'window (selected-window))
      (overlay-put ov 'face
                   (let ((bg-color (face-background 'default nil)))
                     `(:background ,bg-color :foreground ,bg-color)))
      (setq-local cursor-type nil))))


(add-hook 'helm-minibuffer-set-up-hook
          'spacemacs//helm-hide-minibuffer-maybe)

(setq helm-autoresize-max-height 0)
(setq helm-autoresize-min-height 40)
(helm-autoresize-mode 1)
(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x


;; active semantic
(setq helm-semantic-fuzzy-match t
      helm-imenu-fuzzy-match t)

;; helm man and woman
(add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
;; helm locate
(setq helm-locate-fuzzy-match t)
;; helm apropos
(setq helm-apropos-fuzzy-match t)
(setq helm-lisp-fuzzy-completion t)

(require 'helm-descbinds)
(helm-descbinds-mode)


;; active helm grep,just use C-s will have pattern,just like helm-occur
(when (executable-find "ack-grep")
  (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
        helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))

;; helm eshell history
(require 'helm-eshell)

(add-hook 'eshell-mode-hook
          #'(lambda ()
              (define-key eshell-mode-map (kbd "C-c C-l")  'helm-eshell-history)))

;; helm key bind

;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.

(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))

(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
(define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
(define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

(global-set-key (kbd "M-x") #'helm-M-x)
(global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
(global-set-key (kbd "C-x C-f") #'helm-find-files)

;; insert-buffer
(global-set-key (kbd "C-c C-i") 'insert-buffer)

;; helm-show-kill-ring
(global-set-key (kbd "M-y") 'helm-show-kill-ring)

; helm-mini
(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "C-x C-b") 'helm-buffers-list)

;; enable fuzzy matching
(setq helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match t)

;; helm occur
(global-set-key (kbd "C-c h o") 'helm-occur)

;; helm all mark rings
(global-set-key (kbd "C-h SPC") 'helm-all-mark-rings)

;; helm register
(global-set-key (kbd "C-c h x") 'helm-register)

;;helm  google suggest
(global-set-key (kbd "C-c h g") 'helm-google-suggest)

;; helm eval expression with eldoc
(global-set-key (kbd "C-c h M-:") 'helm-eval-expression-with-eldoc)

;;helm-calcul-expression
(global-set-key (kbd "C-c h C-c") 'helm-calcul-expression)
(global-set-key (kbd "C-x r l") 'helm-bookmarks)
(global-set-key (kbd "C-x r m") 'bookmark-set)

(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode +1))

(use-package elpy
  :ensure t
  :init
  (advice-add 'python-mode :before 'elpy-enable))

;; syntax highlighting for html export
(use-package htmlize
:ensure t)

(require 'org)
(use-package org
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c c" . org-capture))
         :config
         (setq org-log-done t))

(require 'org)
;; ignore evaluate message
(setq org-edit-src-content-indentation 0
      org-src-tab-acts-natively t
      org-src-fontify-natively t
      org-confirm-babel-evaluate nil
      )

(defun endless/org-ispell ()
  "Configure `ispell-skip-region-alist' for `org-mode'."
  (make-local-variable 'ispell-skip-region-alist)
  (add-to-list 'ispell-skip-region-alist '(org-property-drawer-re))
  (add-to-list 'ispell-skip-region-alist '("~" "~"))
  (add-to-list 'ispell-skip-region-alist '("=" "="))
  (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_SRC" . "^#\\+END_SRC")))
(add-hook 'org-mode-hook #'endless/org-ispell)

;; Tangle Org files when we save them
(defun tangle-on-save-org-mode-file()
  (when (string= (message "%s" major-mode) "org-mode")
    (org-babel-tangle)))

(add-hook 'after-save-hook 'tangle-on-save-org-mode-file)

;; Enable the auto-revert mode globally. This is quite useful when you have
;; multiple buffers opened that Org-mode can update after tangling.
;; All the buffers will be updated with what changed on the disk.
(global-auto-revert-mode)

;; Add Org files to the agenda when we save them
(defun to-agenda-on-save-org-mode-file()
  (when (string= (message "%s" major-mode) "org-mode")
    (org-agenda-file-to-front)))

(add-hook 'after-save-hook 'to-agenda-on-save-org-mode-file)

;; you could use `C-c C-x C-v` toggle enable inline image
(defun turn-on-org-show-all-inline-images()
  (org-display-inline-images t))
(add-hook 'org-mode-hook 'turn-on-org-show-all-inline-images)

;; Remove the markup characters, i.e., "/text/" becomes (italized) "text"
(setq org-hide-emphasis-markers t)

;; turn on visual-line-mode for org-mode only
;; also install "adaptive-wrap" from epla
(add-hook 'org-mode-hook 'turn-on-visual-line-mode)
