.lisp/my-org-configuration.el

;; CUSTOMISE - you could put a different css file here
;; or nothing at all
(setq org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"http://www.star.bris.ac.uk/bjm/css/bjm.css\" />
<link rel=\"stylesheet\" type=\"text/css\" href=\"bjm.css\" />")

;; short-cuts for common tags
(setq org-tag-alist '(("export" . ?e) ("noexport" . ?n)))

;; use tcsh for shell scripts
;; customize - replace with sh, zsh if you prefer
;;(setq org-babel-sh-command "/bin/tcsh")

;; display results in a block instead of prefixed with :
(setq org-babel-min-lines-for-block-output 1)

;; Some initial languages we want org-babel to support

;; see link: https://github.com/tkf/org-mode/blob/master/lisp/ob-python.el
;; config org-babel
(eval-after-load 'org
  (lambda()
    (require 'ob-python)
    (require 'ob-org)
    (require 'ob-shell)
    (require 'ob-dot)
    (require 'ob-plantuml)
    ))

;; parse tree when you frequently search specified string
(setq org-agenda-custom-commands
      '(("g" occur-tree "revolt")))

(setq org-agenda-files '("~/org/inbox.org"
                         "~/org/gtd.org"
                         "~/org/tickler.org"))

(setq org-capture-templates '(("t" "Todo [inbox]" entry
                               (file+headline "~/org/inbox.org" "Tasks")
                               "* TODO %i%?")
                              ("T" "Tickler" entry
                               (file+headline "~/org/tickler.org" "Tickler")
                               "* %i%? \n %U")))

(setq org-image-actual-width t)

(use-package org-bullets
  :config
  (setq org-bullets-bullet-list '("◉" "◎" "✽" "✽" "♡" "❀"))
  (add-hook 'org-mode-hook
            (lambda () (org-bullets-mode 1))))

;; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
(setq utf-translate-cjk-mode nil)

(set-language-environment 'utf-8)
(setq locale-coding-system 'utf-8)

;; set the default encoding system
(prefer-coding-system 'utf-8)
(setq default-file-name-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
;; backwards compatibility as default-buffer-file-coding-system
;; is deprecated in 23.2.
(if (boundp buffer-file-coding-system)
    (setq buffer-file-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8))

;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(autoload 'footnote-mode "footnote" nil t)
;; Example for Gnus. If you use an other mailer you will replace the hook with the appropriated hook of your mailer.
(add-hook 'message-mode-hook 'footnote-mode)

(add-hook 'message-mode-hook 'turn-on-orgtbl)

(global-set-key (kbd "M-C-g") 'org-plot/gnuplot)

(global-set-key (kbd "C-c &") 'org-mark-ring-goto)

;; install plantuml-mode
;; load plantuml
(setq org-plantuml-jar-path (expand-file-name "~/org/.plantuml/plantuml.jar"))
;; helper function
(defun my-org-confirm-babel-evaluate (lang body)
  "Do not ask for confirmation to evaluate code for specified languages。"
  (member lang '("plantuml")))

;; trust certain code as being safe
(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

;; automatically show the resulting image
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
